# Seasonal Menu Alchemy

### Data Preperation

In [2]:
import pandas as pd

# Read the data from CSV files
df_a = pd.read_csv('Summermenusales.csv')
df_b = pd.read_csv('Wintermenusales.csv')

In [3]:
df_a

   Year      Month  Revenue  Number of Customers
0  2022     August     8800                  440
1  2022  September    10120                  495
2  2022    October     8250                  418
3  2022   November     7480                  374
4  2022   December     6050                  308
5  2023    January     5720                  286
6  2023   February     6160                  308

In [4]:
df_b

   Year      Month  Revenue  Number of Customers
0  2022     August     8800                  440
1  2022  September    11550                  572
2  2022    October    10780                  539
3  2022   November     9570                  478
4  2022   December     8690                  440
5  2023    January     7860                  392
6  2023   February     8800                  440

In [5]:
# Use %store to share the DataFrame with a specific key
%store df_a
%store df_b

Stored 'df_a' (DataFrame)
Stored 'df_b' (DataFrame)